app/controllers/api/appointment_requests_controller.rb

SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
      @nutritionist = Nutritionist.find(params[:nutritionist_id])

SELECT "appointment_requests".* FROM "appointment_requests" WHERE "appointment_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def accept
      @request = AppointmentRequest.find(params[:id])

SELECT "appointment_requests".* FROM "appointment_requests" WHERE "appointment_requests"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def reject
      @request = AppointmentRequest.find(params[:id])