app/views/nutritionists/index.html.erb

SELECT "services".* FROM "services" WHERE "services"."nutritionist_id" IN ($1, $2, $3, $4, $5, $6)  [["nutritionist_id", 1], ["nutritionist_id", 4], ["nutritionist_id", 3], ["nutritionist_id", 5], ["nutritionist_id", 2], ["nutritionist_id", 6]]
---
          <div class="nutritionist-services">
            <% nutritionist.services.each do |service| %>