app/controllers/appointment_requests_controller.rb

  def create
    @nutritionist = Nutritionist.find(params[:nutritionist_id])
    @appointment_request = @nutritionist.appointment_requests.build(appointment_request_params)

    if @appointment_request.save
---
SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "appointment_requests" ("guest_name", "guest_email", "requested_at", "status", "nutritionist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"