app/controllers/nutritionists_controller.rb

SELECT "services".* FROM "services" WHERE "services"."nutritionist_id" IN ($1, $2, $3, $4, $5, $6)  [["nutritionist_id", 1], ["nutritionist_id", 4], ["nutritionist_id", 3], ["nutritionist_id", 5], ["nutritionist_id", 2], ["nutritionist_id", 6]]
SELECT COUNT(*) FROM (SELECT DISTINCT nutritionists.*, CASE WHEN nutritionists.location ILIKE '%Braga%' THEN 0 ELSE 1 END as location_priority FROM "nutritionists" LEFT OUTER JOIN "services" ON "services"."nutritionist_id" = "nutritionists"."id") subquery_for_count
SELECT DISTINCT nutritionists.*, CASE WHEN nutritionists.location ILIKE '%Braga%' THEN 0 ELSE 1 END as location_priority FROM "nutritionists" LEFT OUTER JOIN "services" ON "services"."nutritionist_id" = "nutritionists"."id" ORDER BY location_priority, nutritionists.name LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @location = params[:location].presence || "Braga"
    @query = params[:query]

    @nutritionists = Nutritionist.search(@query, @location)
                                  .includes(:services)
                                  .page(params[:page])

SELECT "nutritionists".* FROM "nutritionists" WHERE "nutritionists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def requests
    @nutritionist = Nutritionist.find(params[:id])