app/models/appointment_request.rb

UPDATE "appointment_requests" SET "status" = $1 WHERE "appointment_requests"."guest_email" = $2 AND "appointment_requests"."status" = $3  [["status", 3], ["guest_email", "[FILTERED]"], ["status", 0]]
---
  def cancel_previous_pending_requests
    AppointmentRequest
      .where(guest_email: guest_email, status: :pending)
      .update_all(status: :cancelled)

UPDATE "appointment_requests" SET "status" = $1 WHERE "appointment_requests"."nutritionist_id" = $2 AND "appointment_requests"."requested_at" = $3 AND "appointment_requests"."status" = $4 AND "appointment_requests"."id" != $5  [["status", 3], ["nutritionist_id", 1], ["requested_at", "2026-02-02 10:00:00"], ["status", 0], ["id", 1]]
---
  def cancel_conflicting_requests!
    AppointmentRequest
      .where(nutritionist_id: nutritionist_id, requested_at: requested_at, status: :pending)
      .where.not(id: id)
      .update_all(status: :cancelled)